mafeiGitHub/stm32Mp3/main/main.cpp
                // read next chunks worth, including rest of frame, 32bit aligned
                count++;
                int bytesLoaded;
                FRESULT fresult = file.read (nextChunkPtr + bytesLeft, chunkSize, bytesLoaded);
                if (fresult) {
                  //{{{  error
                  cLcd::debug ("wave read " + dec (count) + " " + dec (fresult));
                  vTaskDelay (100);
                  goto exitWave;
                  }
                  //}}}
                if (bytesLoaded) {
                  chunkPtr = nextChunkPtr;
                  bytesLeft += bytesLoaded;
                  }
                else
                  bytesLeft = 0;
                }
              if (bytesLeft >= mp3->getFrameBodySize()) {
                mFrameOffsets[mWaveLoadFrame] = file.getPosition(); // not right !!!!
                auto frameBytes = mp3->decodeFrameBody (chunkPtr, mWave + 1 + (mWaveLoadFrame * 2), nullptr);
                if (*wavePtr > *mWave)
                  *mWave = *wavePtr;
                wavePtr++;
                if (*wavePtr > *mWave)
                  *mWave = *wavePtr;
                wavePtr++;
                mWaveLoadFrame++;

                if (frameBytes) {
                  chunkPtr += frameBytes;
                  bytesLeft -= frameBytes;
                  }
                else
                  bytesLeft = 0;
                }
              }
            } while ((fileIndex == loadedFileIndex) && headerBytes && (bytesLeft > 0));
          }
        } while ((fileIndex == loadedFileIndex) && (bytesLeft > 0));
      }
  exitWave:
    cLcd::debug ("wave loaded");

    // wait for file change
    while (fileIndex == loadedFileIndex)
      vTaskDelay (100);
    }
  }
//}}}

//{{{
static void netThread (void const* argument) {

  tcpip_init (NULL, NULL);
  cLcd::debug ("configuring ethernet");

  // init LwIP stack
  struct ip_addr ipAddr;
  IP4_ADDR (&ipAddr, 192, 168, 1, 67);
  struct ip_addr netmask;
  IP4_ADDR (&netmask, 255, 255 , 255, 0);
  struct ip_addr gateway;
  IP4_ADDR (&gateway, 192, 168, 0, 1);

  struct netif netIf;
  netif_add (&netIf, &ipAddr, &netmask, &gateway, NULL, &ethernetif_init, &tcpip_input);
  netif_set_default (&netIf);

  if (netif_is_link_up (&netIf)) {
    netif_set_up (&netIf);
    if (kStaticIp)
      //{{{  static ip
      cLcd::get()->info (COL_YELLOW, "ethernet static ip " + dec ((int) (netIf.ip_addr.addr & 0xFF)) + "." +
                                                      dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                                      dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                                      dec ((int) (netIf.ip_addr.addr >> 24)));
      //}}}
    else {
      //{{{  dhcp ip
      struct ip_addr nullIpAddr;
      IP4_ADDR (&nullIpAddr, 0, 0, 0, 0);
      netIf.ip_addr = nullIpAddr;
      netIf.netmask = nullIpAddr;
      netIf.gw = nullIpAddr;
      dhcp_start (&netIf);

      while (true) {
        if (netIf.ip_addr.addr) {
          //{{{  dhcp allocated
          std::string address = dec ( (int)(netIf.ip_addr.addr & 0xFF)) + "." +
                                dec ((int)((netIf.ip_addr.addr >> 16) & 0xFF)) + "." +
                                dec ((int)((netIf.ip_addr.addr >> 8) & 0xFF)) + "." +
                                dec ( (int)(netIf.ip_addr.addr >> 24));
          cLcd::get()->info (COL_YELLOW, "dhcp " + address);

          dhcp_stop (&netIf);
          break;
          }
          //}}}
        else if (netIf.dhcp->tries > 4) {
          //{{{  dhcp timeout
          cLcd::get()->info (COL_RED, "dhcp timeout");
          dhcp_stop (&netIf);

          // use static address
          struct ip_addr ipAddr;
          IP4_ADDR (&ipAddr, 192 ,168 , 1 , 67 );
          struct ip_addr netmask;
          IP4_ADDR (&netmask, 255, 255, 255, 0);
          struct ip_addr gateway;
          IP4_ADDR (&gateway, 192, 168, 0, 1);
          netif_set_addr (&netIf, &ipAddr , &netmask, &gateway);
          break;
          }
          //}}}
        vTaskDelay (250);
        }
      }
      //}}}

    TaskHandle_t handle;
    xTaskCreate ((TaskFunction_t)hlsLoaderThread, "hlsLoad", 14000, 0, 3, &handle);
    xTaskCreate ((TaskFunction_t)hlsPlayerThread, "hlsPlay", 2000, 0, 4, &handle);
    xTaskCreate ((TaskFunction_t)httpServerThread, "http", DEFAULT_THREAD_STACKSIZE, 0, 4, &handle);
    //xTaskCreate ((TaskFunction_t)ftpServerThread, "ftp", DEFAULT_THREAD_STACKSIZE, 0, 4, &handle);
    }
  else {
    //{{{  no ethernet
    netif_set_down (&netIf);
    cLcd::get()->info (COL_RED, "no ethernet");
    }
    //}}}

  vTaskDelete (NULL);
  }
//}}}
//{{{
static void mainThread (void const* argument) {

  const bool kMaxTouch = 1;
  mLcd->displayOn();

  SD_Init();
  if (!SD_present()) {
    //{{{  HLS player
    mHls = new cHls();

    mReSamples = (int16_t*)bigMalloc (4096, "hlsResamples");
    memset (mReSamples, 0, 4096);

    mLcd->setShowDebug (false, false, false, false);  // debug - title, info, lcdStats, footer
    hlsMenu (mRoot, mHls);

    vSemaphoreCreateBinary (mHlsSem);

    TaskHandle_t handle;
    xTaskCreate ((TaskFunction_t)netThread, "Net", 1024, 0, 3, &handle);
    }
    //}}}
  else if (BSP_PB_GetState (BUTTON_WAKEUP) == GPIO_PIN_SET) {
    //{{{  USB MSC
    USBD_Init (&USBD_Device, &MSC_Desc, 0);
    USBD_RegisterClass (&USBD_Device, &USBD_MSC);
    USBD_MSC_RegisterStorage (&USBD_Device, (USBD_StorageTypeDef*)(&USBD_DISK_fops));
    USBD_Start (&USBD_Device);

    cLcd::debug ("USB ok");
    }
    //}}}
  else {
    //{{{  MP3 player
    mFrameOffsets = (int*)bigMalloc (60*60*40*sizeof(int), "mp3FrameOff");
    mWave = (uint8_t*)bigMalloc (60*60*40*2*sizeof(uint8_t), "mp3Wave");  // 1 hour of 40 mp3 frames per sec
    mWave[0] = 0;
    mWaveLoadFrame = 0;

    initMp3Menu (mRoot);
    mLcd->setShowDebug (false, false, false, true);  // disable debug - title, info, lcdStats, footer

